Revit 2027 API
BuiltInFailures.MassFailures.FaceSplitFailed Property
 A face of a joined (i.e. one cuts another) mass could not be split into interior and exterior faces. Remove the cut to resolve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FaceSplitFailed { get; }
Public Shared ReadOnly Property FaceSplitFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FaceSplitFailed {
	FailureDefinitionId^ get ();
}
static member FaceSplitFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace